Тестовая_база_ERP_14/src/Documents/АГ_ЗаявкаНаДобровольнуюСертификацию/АГ_ЗаявкаНаДобровольнуюСертификацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_ЗаявкаНаДобровольнуюСертификацию</name>
  <comment>АГ:[+][DOBS_001_2][29.05.2019 22:57][Коробков]</comment>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьЗаявки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФайлаДанных</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификация</name>
    <attributes>
      <name>НоменклатураИзЗаказаПоставщика</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураДляСертификации</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаДляСертификации</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативнаяДокументация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрилагаемыеДокументы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВагонаТС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПоСертификату</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодлежитСертификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНовогоСертификата</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНовогоСертификата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеДокументы</name>
    <attributes>
      <name>НаименованиеФайла</name>
      <type>
        <types>CatalogRef.АГ_ЗаявкаНаДобровольнуюСертификациюПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Documents/АГ_ЗаявкаНаДобровольнуюСертификацию/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Если ТипЗнч(ДанныеЗаполнения.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.Номенклатура КАК Номенклатура,
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.НоменклатураДляСертификации КАК НоменклатураДляСертификации,
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.ХарактеристикаНоменклатурыДляСертификации КАК ХарактеристикаНоменклатурыДляСертификации
			|ИЗ
			|	Документ.ЗаказПоставщику.АГ_ДобровольнаяСертификацияНоменклатура КАК ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура
			|ГДЕ
			|	ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.Ссылка = &Ссылка
			|	И ЗаказПоставщикуАГ_ДобровольнаяСертификацияНоменклатура.Ссылка.АГ_ДобровольнаяСертификация";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Распоряжение);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			ДобровольнаяСертификация = Ложь;			
			Для каждого СтрокаТЧ из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Сертификация.Добавить();
				НоваяСтрока.НоменклатураИзЗаказаПоставщика = СтрокаТЧ.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
				
				//СтруктураПоиск= Новый Структура("", ) 
				//НоваяСтрока.НоменклатураДляСертификации = РезультатЗапроса.НоменклатураДляСертификации;
				//НоваяСтрока.ХарактеристикаДляСертификации = РезультатЗапроса.ХарактеристикаНоменклатурыДляСертификации;
				//
				//СтрокаНоменклатуры = ДанныеЗаполнения.Товары.Найти(РезультатЗапроса.Номенклатура);
				//НоваяСтрока.ВесПоСертификату =
				//НоваяСтрока.СерияНоменклатуры = СтрокаНоменклатуры.Серия;
				//НоваяСтрока.ДокументОснование = ДанныеЗаполнения.Ссылка;
					
				ДобровольнаяСертификация = Истина;
			КонецЦикла;
			
			Если не ДобровольнаяСертификация Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный товар не подлежит сертификации");
			иначе
				Контрагент = ДанныеЗаполнения.АГ_Контрагент;
				Склад = ДанныеЗаполнения.Склад;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
